app/views/clients/index.html.erb

SELECT "clients".* FROM "clients" LIMIT 30 OFFSET 0
---
      <tr>
        <th><%= t('activerecord.attributes.client.firstname') %></th>