app/views/clients/show.html.erb

SELECT COUNT(*) FROM "operations" WHERE "operations"."client_id" = 1
---

<% if @client.operations.any? %>