app/controllers/admins_controller.rb

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    Admin.find(params[:id]).destroy