app/controllers/admins_controller.rb

  def index
    @admins = Admin.paginate(page: params[:page])
---
SELECT "admins".* FROM "admins" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "admins"

  def create
    @admin = Admin.new(params[:admin])
    if @admin.save
---
INSERT INTO "admins" ("created_at", "email", "firstname", "lastname", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "1"]]

   def update
    @admin = Admin.find(params[:id])
    if @admin.update_attributes(params[:admin])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "admins" SET "firstname" = 'Newfirstname', "lastname" = 'NEWLASTNAME', "email" = 'new@example.com', "password_digest" = '$2a$04$5VBAF9AZ15SnEv7rI/Kln.pZDsfGFfDw1s6MXuKeHsaCioj/wjj56', "remember_token" = '6sAKzMeYPFr16LETrJKmGw', "updated_at" = '2012-10-06 21:15:10.416106' WHERE "admins"."id" = 1