app/controllers/clients_controller.rb

  def index
    @clients = Client.paginate(page: params[:page])
---
SELECT "clients".* FROM "clients" ORDER BY clients.lastname DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "clients"

  def create
    @client = Client.new(params[:client])
    if @client.save
---
INSERT INTO "clients" ("box", "city", "country", "created_at", "firstname", "house", "lastname", "phone", "street", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? ORDER BY clients.lastname LIMIT 1  [["id", "25"]]

  def update
    @client = Client.find(params[:id])
    if @client.update_attributes(params[:client])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "house" = '123', "box" = '', "updated_at" = '2012-10-09 20:07:41.458670' WHERE "clients"."id" = 30

  def destroy
    Client.find(params[:id]).destroy
---
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? ORDER BY clients.lastname LIMIT 1  [["id", "52"]]