app/controllers/operations_controller.rb

SELECT COUNT(*) AS count_all, client_id AS client_id FROM "operations" GROUP BY client_id ORDER BY operations.value_date DESC
SELECT client_id, sum(total) as total FROM "operations" GROUP BY client_id ORDER BY operations.value_date DESC LIMIT 30 OFFSET 0
---
  def index
    #@operations = Operation.paginate(page: params[:page])
    @operations = Operation.select("client_id, sum(total) as total").group("client_id").paginate(page: params[:page])

INSERT INTO "operations" ("client_id", "close_date", "created_at", "duration", "interests", "operation_type", "rate", "sum", "total", "updated_at", "value_date") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @operation = @client.operations.new(params[:operation])
    if @operation.save

SELECT "operations".* FROM "operations" WHERE "operations"."client_id" = 1 AND "operations"."id" = ? ORDER BY operations.value_date DESC LIMIT 1  [["id", "1"]]
---
  def edit
    @operation = @client.operations.find(params[:id])

SELECT "operations".* FROM "operations" WHERE "operations"."client_id" = 1 AND "operations"."id" = ? ORDER BY operations.value_date DESC LIMIT 1  [["id", "1"]]
UPDATE "operations" SET "sum" = 10000.0, "interests" = 598.3561643835617, "total" = 10598.3561643835617, "updated_at" = '2012-10-22 21:27:05.531611' WHERE "operations"."id" = 1
---
  def update
    @operation = @client.operations.find(params[:id])
    if @operation.update_attributes(params[:operation])

DELETE FROM "operations" WHERE "operations"."id" = ?  [["id", 2]]
SELECT "operations".* FROM "operations" WHERE "operations"."client_id" = 25 AND "operations"."id" = ? ORDER BY operations.value_date DESC LIMIT 1  [["id", "2"]]
---
  def destroy
    @client.operations.find(params[:id]).destroy

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? ORDER BY clients.lastname LIMIT 1  [["id", "37"]]
---
  def find_client
    @client = Client.find(params[:client_id])