app/controllers/sessions_controller.rb

  def create
    user = Admin.find_by_email(params[:session][:email])
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'user@example.com' LIMIT 1