app/views/operations/_operation.html.erb

<tr>
  <td><%= operation.client.firstname%></td>
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 ORDER BY clients.lastname LIMIT 1