app/views/operations/index.html.erb

        <th><%= t('activerecord.attributes.client.lastname') %></th>
        <th><%= t('activerecord.attributes.client.firstname') %></th>
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]